src/sonicFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       4900;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          17;
        startFace       4950;
    }
    wedge
    {
        type            patch;
        nFaces          33;
        startFace       4967;
    }
    top
    {
        type            patch;
        nFaces          50;
        startFace       5000;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       5050;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       7550;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       10050;
    }
)

// ************************************************************************* //
